src/cf/InformationRegisters/CRM_ОбъектыАРМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ОбъектыАРМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДляСортировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИнтереса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Избранный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаименованиеАРМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзмерениеАРМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеИнтереса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияИнтересов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_СостоянияЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_СостоянияЛидов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияЛидов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныОтказаПоИнтересам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_СообщениеМессенджера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ЗадачиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗадачиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧтоСделать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_Взаимодействие</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/CRM_ВидыСообщенияМессенджера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВидыСообщенияМессенджера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/CRM_Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_Взаимодействие</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Баллы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияВзаимодействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_Интерес</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Телемаркетинг</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяВыручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальныйКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИнтереса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершение</Name>
					<Comment>Используется только в календаре, для управления длительностью взаимодействия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершившийПользователь</Name>
					<Comment>Завершивший пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/CRM_РаботаАРМСервер/Ext/Module.bsl
Процедура CRM_ЗаполнениеАРММоиДела(Источник, Отказ) Экспорт
	
	Ссылка = Источник.ссылка;
	//+вог
	Если Не (ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Мероприятие")
	  ИЛИ ТипЗнч(Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")) Тогда
		Возврат;	
	КонецЕсли;
	//-вог
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ОбъектыАРМ.Объект,
	|	CRM_ОбъектыАРМ.НаименованиеАРМ,
	|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
	|	CRM_ОбъектыАРМ.Пользователь
	|ИЗ
	|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
	|ГДЕ
	|	CRM_ОбъектыАРМ.Объект = &Объект
	|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
	Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.Объект = Ссылка;
		Запись.НаименованиеАРМ = "МоиДела";
		Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Прочитать();
		Если Запись.Объект <> Неопределено Тогда
			Если ТипЗнч(Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				БизнесПроцесс = Источник.БизнесПроцесс;
				Если Источник.Выполнена Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Завершено;
				ИначеЕсли ЗначениеЗаполнено(БизнесПроцесс) И БизнесПроцесс.Завершен И НЕ Источник.Выполнена Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Отменено;
				ИначеЕсли ЗначениеЗаполнено(БизнесПроцесс) И БизнесПроцесс.Стартован И НЕ БизнесПроцесс.Завершен И НЕ Источник.ПринятаКИсполнению Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Запланировано;
				ИначеЕсли ЗначениеЗаполнено(БизнесПроцесс) И БизнесПроцесс.Стартован И НЕ БизнесПроцесс.Завершен И Источник.ПринятаКИсполнению Тогда
					СтатусЗадачи = Справочники.CRM_СостоянияСобытий.ВРаботе;
				КонецЕсли;
				Если СтатусЗадачи <> Справочники.CRM_СостоянияСобытий.Завершено И СтатусЗадачи <> Справочники.CRM_СостоянияСобытий.Запланировано Тогда
					//Возврат;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
				Если Источник.СтатусВзаимодействия <> Справочники.CRM_СостоянияСобытий.Завершено И Источник.СтатусВзаимодействия <> Справочники.CRM_СостоянияСобытий.Отменено Тогда
					//Возврат;
				КонецЕсли;	
			//+вог
			ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Мероприятие") Тогда
				Если Источник.Состояние <> Справочники.CRM_СостоянияСобытий.Завершено И Источник.Состояние <> Справочники.CRM_СостоянияСобытий.Отменено Тогда
					//Возврат;
				КонецЕсли;	
			//-вог	
			Иначе	
				Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") или ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
					Если Ссылка.CRM_СкрытьВАРМ Тогда 
						Запись.Удалить();
					КонецЕсли;
				КонецЕсли;	
				//Возврат;
			КонецЕсли;	
		КонецЕсли;
		Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.CRM_Мероприятие") Тогда
			Запись.Удалить();
		КонецЕсли;	
	КонецЦикла;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_Взаимодействие.Ссылка
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	CRM_Взаимодействие.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		ВыборкаВзаимодействия = Запрос.Выполнить().Выбрать();
		Пока ВыборкаВзаимодействия.Следующий() Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CRM_ОбъектыАРМ.Объект,
			|	CRM_ОбъектыАРМ.НаименованиеАРМ,
			|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
			|	CRM_ОбъектыАРМ.Пользователь
			|ИЗ
			|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
			|ГДЕ
			|	CRM_ОбъектыАРМ.Объект = &Объект
			|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
			Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
			Запрос.УстановитьПараметр("Объект", ВыборкаВзаимодействия.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Запись.Объект = Ссылка;
				Запись.НаименованиеАРМ = "МоиДела";
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
				Запись.Пользователь = Выборка.Пользователь;
				Запись.Прочитать();
				Запись.Удалить();
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Иначе	
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				Если ВыборкаВзаимодействия.Ссылка.Ответственный = ВыборкаВзаимодействия.Ссылка.Автор Тогда
					Запись.ИзмерениеАРМ = "Текущие";
				Иначе
					Запись.ИзмерениеАРМ = "Входящие";
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Или Источник.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			Запись.ДатаДляСортировки = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			Запись.Объект = ВыборкаВзаимодействия.Ссылка;
			Контакт = "";
			Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.Партнер) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.Партнер.Наименование;
				Запись.Клиент = ВыборкаВзаимодействия.Ссылка.Партнер;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо.Наименование;
				Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент) Тогда
				Контакт = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент.Наименование;
				Запись.Клиент = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент;
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
				Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
			КонецЕсли;	
			Запись.КрайнийСрок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			тТема 			= ВыборкаВзаимодействия.Ссылка.Содержание;
			ТекстОписания = Строка(ВыборкаВзаимодействия.Ссылка.СостояниеИнтереса);
			НаКонтроле = Ложь;
			ДатаПолучения = Дата('00010101');
			//Контакт = "";
			КонтактАдрес = "";
			Запись.Пользователь = ВыборкаВзаимодействия.Ссылка.Ответственный;
			Срок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
			Запись.День = Формат(Срок, "ДЛФ=DD");
			Запись.Избранный = Источник.Избранный;
			Запись.ВидКартинки = 9;
			
			
			Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(ВыборкаВзаимодействия.Ссылка.ПлановаяДатаЗавершение, "ДФ='HH:mm'");
			
			Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  ВыборкаВзаимодействия.Ссылка.ДатаЗавершенияВзаимодействия;
			КонецЕсли;
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
			Запись.ТекстОснования = ТекстОписания;
			
			Запись.Записать(Истина);
			
		КонецЦикла;	
		Возврат;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Если Ссылка.ПометкаУдаления ИЛИ Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		тТема 			= Источник.Тема;
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.ОтправительКонтакт;
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент = Контакт.Владелец;
			Контакт = Контакт.Владелец;
			
		КонецЕсли;	
		Запись.Контакт = Источник.ОтправительКонтакт;
		КонтактАдрес = Источник.ОтправительАдрес;
		ТекстОписания = "";	
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "Входящие";
		Срок = Источник.ДатаПолучения;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 12;
		Если Источник.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;	
		Запись.Время = Формат(Источник.ДатаПолучения, "ДФ='HH:mm'") + " - " + Формат(Источник.ДатаПолучения, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Если Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Если НЕ Источник.Входящий Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		тТема 			= Источник.Тема;
		НаКонтроле = Ложь;
		ТекстОписания = "";
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.АбонентКонтакт;
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент = Контакт.Владелец;
			Контакт = Контакт.Владелец;
			
		КонецЕсли;	
		Запись.Контакт = Источник.АбонентКонтакт;
		КонтактАдрес = Источник.АбонентКакСвязаться;
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "Входящие";
		Срок = Источник.Дата;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 13;
		Если Источник.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;
		Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Мероприятие") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ОбъектыАРМ.Объект,
		|	CRM_ОбъектыАРМ.НаименованиеАРМ,
		|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
		|	CRM_ОбъектыАРМ.Пользователь
		|ИЗ
		|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
		|ГДЕ
		|	CRM_ОбъектыАРМ.Объект = &Объект
		|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
		Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
		Запрос.УстановитьПараметр("Объект", Ссылка);
		//Запрос.УстановитьПараметр("Пользователь", Источник.Ответственный);
		Выборка = Запрос.Выполнить().Выбрать();

		//Если НЕ Источник.Входящий Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Пока Выборка.Следующий() Цикл
			Стр = Источник.СвоиЛица.Найти(Выборка.Пользователь, "Лицо");
			Если Стр  = Неопределено И Выборка.Пользователь<>Источник.Ответственный Тогда
				Запись.Объект = Ссылка;
				Запись.НаименованиеАРМ = "МоиДела";
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
				Запись.Пользователь = Выборка.Пользователь;
				Запись.Прочитать();
				Запись.Удалить();
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ОбъектыАРМ.Объект КАК Объект,
		|	CRM_ОбъектыАРМ.НаименованиеАРМ КАК НаименованиеАРМ,
		|	CRM_ОбъектыАРМ.ИзмерениеАРМ КАК ИзмерениеАРМ,
		|	CRM_ОбъектыАРМ.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
		|ГДЕ
		|	CRM_ОбъектыАРМ.Объект = &Объект
		|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ
		|	И CRM_ОбъектыАРМ.Пользователь = &Пользователь";
		Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Запрос.УстановитьПараметр("Пользователь", Источник.Ответственный);
		Выборка = Запрос.Выполнить().Выбрать();

		//Если НЕ Источник.Входящий Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Если Выборка.Следующий() Тогда
			Запись.Объект = Ссылка;
			Запись.НаименованиеАРМ = "МоиДела";
			Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Запись.Пользователь = Выборка.Пользователь;
			Запись.Прочитать();
			Запись.Удалить();
		КонецЕсли;
		
		
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		тТема 			= Источник.Тема;
		НаКонтроле = Ложь;
		ТекстОписания = "";
		ДатаПолучения = Источник.Дата;
		Запись.Контакт = Источник.СписокУчастников;
		Запись.Пользователь = Источник.Ответственный;
		Если Источник.Состояние = Справочники.CRM_СостоянияСобытий.Завершено или  Источник.Состояние = Справочники.CRM_СостоянияСобытий.Отменено Тогда
			Запись.ИзмерениеАРМ = "Завершенные";
		Иначе
			Попытка
				Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Исключение	
				Запись.ИзмерениеАРМ = "Текущие";
			КонецПопытки;
		КонецЕсли;
		Если Запись.ИзмерениеАРМ = "" Тогда
			Запись.ИзмерениеАРМ = "Текущие";
		КонецЕсли;	
		Срок = Источник.Дата;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 15;
		Запись.Избранный = Ложь;
		Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		
		Запись.ТекстОснования = Источник.Описание;
		
		Запись.Записать(Истина);	
		Для Каждого СтрокаУчастники Из Источник.СвоиЛица Цикл
			Если СтрокаУчастники.Лицо <> Источник.Ответственный И ТипЗнч(СтрокаУчастники.Лицо) = Тип("СправочникСсылка.Пользователи") Тогда
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	CRM_ОбъектыАРМ.Объект,
				|	CRM_ОбъектыАРМ.НаименованиеАРМ,
				|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
				|	CRM_ОбъектыАРМ.Пользователь
				|ИЗ
				|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
				|ГДЕ
				|	CRM_ОбъектыАРМ.Объект = &Объект
				|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ
				|	И CRM_ОбъектыАРМ.Пользователь = &Пользователь";
				Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
				Запрос.УстановитьПараметр("Объект", Ссылка);
				Запрос.УстановитьПараметр("Пользователь", СтрокаУчастники.Лицо);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
					Запись.Объект = Ссылка;
					Запись.НаименованиеАРМ = "МоиДела";
					Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
					Запись.Пользователь = Выборка.Пользователь;
					Запись.Прочитать();
					Запись.Удалить();
					Запись.ДатаДляСортировки = Источник.Дата;
					Запись.Объект = Ссылка;
					Запись.КрайнийСрок = Источник.Дата;
					тТема 			= Источник.Тема;
					НаКонтроле = Ложь;
					ТекстОписания = "";
					ДатаПолучения = Источник.Дата;
					Запись.Контакт = Источник.СписокУчастников;
					Запись.Пользователь = СтрокаУчастники.Лицо;
					Если Источник.Состояние = Справочники.CRM_СостоянияСобытий.Завершено или  Источник.Состояние = Справочники.CRM_СостоянияСобытий.Отменено Тогда
						Запись.ИзмерениеАРМ = "Завершенные";
					Иначе
						Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
					КонецЕсли;
					
					Срок = Источник.Дата;
					Запись.День = Формат(Срок, "ДЛФ=DD");
					Запись.ВидКартинки = 3;
					Запись.Избранный = Ложь;
					Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
					Запись.НаименованиеАРМ = "МоиДела";
					
					Запись.Заголовок = Строка(тТема);
					
					
					Запись.ТекстОснования = Источник.Описание;
					
					Запись.Записать(Истина);
				Иначе	
					Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
					
					Запись.ДатаДляСортировки = Источник.Дата;
					Запись.Объект = Ссылка;
					Запись.КрайнийСрок = Источник.Дата;
					тТема 			= Источник.Тема;
					НаКонтроле = Ложь;
					ТекстОписания = "";
					ДатаПолучения = Источник.Дата;
					Запись.Контакт = Источник.СписокУчастников;
					Запись.Пользователь = СтрокаУчастники.Лицо;
					Если Источник.Состояние = Справочники.CRM_СостоянияСобытий.Завершено или  Источник.Состояние = Справочники.CRM_СостоянияСобытий.Отменено Тогда
						Запись.ИзмерениеАРМ = "Завершенные";
					Иначе
						Запись.ИзмерениеАРМ = "Входящие";
					КонецЕсли;
					
					Срок = Источник.Дата;
					Запись.День = Формат(Срок, "ДЛФ=DD");
					Запись.ВидКартинки = 15;
					Запись.Избранный = Ложь;
					Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
					Запись.НаименованиеАРМ = "МоиДела";
					
					Запись.Заголовок = Строка(тТема);
					
					
					Запись.ТекстОснования = Источник.Описание;
					
					Запись.Записать(Истина);
				КонецЕсли;
				
				
			КонецЕсли;	
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
		
		Если Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Или Источник.ПометкаУдаления Тогда
			
		Иначе
			Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			Запись.ДатаДляСортировки = Источник.ПлановаяДата;
			Запись.Объект = Ссылка;
			Контакт = "";
			Если ЗначениеЗаполнено(Источник.Партнер) Тогда
				Контакт = Источник.Партнер.Наименование;
				Запись.Клиент = Источник.Партнер;
			ИначеЕсли ЗначениеЗаполнено(Источник.КонтактноеЛицо) Тогда
				Контакт = Источник.КонтактноеЛицо.Наименование;
				Запись.Контакт = Источник.КонтактноеЛицо;
			ИначеЕсли ЗначениеЗаполнено(Источник.ПотенциальныйКлиент) Тогда
				Контакт = Источник.ПотенциальныйКлиент.Наименование;
				Запись.Клиент = Источник.ПотенциальныйКлиент;
			КонецЕсли;
			Если ЗначениеЗаполнено(Источник.КонтактноеЛицо) Тогда
				Запись.Контакт = Источник.КонтактноеЛицо;
			КонецЕсли;	
			Запись.КрайнийСрок = Источник.ПлановаяДата;
			тТема 			= Источник.Содержание;
			ТекстОписания = Строка(Источник.СостояниеИнтереса);
			НаКонтроле = Ложь;
			ДатаПолучения = Дата('00010101');
			//Контакт = "";
			КонтактАдрес = "";
			Запись.Пользователь = Источник.Ответственный;
			Срок = Источник.ПлановаяДата;
			Запись.День = Формат(Срок, "ДЛФ=DD");
			Если ТипЗнч(Источник.ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				Если Источник.ДокументОснование.CRM_Личная Тогда
					Запись.ВидКартинки = 3;
				Иначе	
					Запись.ВидКартинки = 6;
				КонецЕсли;	
				Если Источник.ДокументОснование.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
					Запись.Избранный = Истина;
				Иначе	
					Запись.Избранный = Ложь;
				КонецЕсли;
			Иначе
				Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
					Запись.Избранный = Источник.ДокументОснование.Избранный;
				КонецЕсли;
				Запись.ВидКартинки = 9;
			КонецЕсли;
			
			Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(Источник.ПлановаяДатаЗавершение, "ДФ='HH:mm'");
			Если Источник.Ответственный = Источник.Автор Тогда
				Запись.ИзмерениеАРМ = "Текущие";
			Иначе
				Запись.ИзмерениеАРМ = "Входящие";
			КонецЕсли;	
			Если Источник.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  Источник.ДатаЗавершенияВзаимодействия;
			КонецЕсли;	
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
			Запись.ТекстОснования = ТекстОписания;
			
			Запись.Записать(Истина);
		КонецЕсли;
	//+вог
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Мероприятие") Тогда
		
		Если Источник.Состояние = Справочники.CRM_СостоянияСобытий.Отменено Или Источник.ПометкаУдаления Тогда
			
		Иначе
			Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			Запись.ДатаДляСортировки = Источник.Дата;
			Запись.Объект = Ссылка;
			Контакт = "";
			Если ЗначениеЗаполнено(Источник.СторонниеЛица[0].Партнер) Тогда
				Контакт = Источник.СторонниеЛица[0].Партнер.Наименование;
				Запись.Клиент = Источник.СторонниеЛица[0].Партнер;
			ИначеЕсли ЗначениеЗаполнено(Источник.СторонниеЛица[0].КонтактноеЛицо) Тогда
				Контакт = Источник.СторонниеЛица[0].КонтактноеЛицо.Наименование;
				Запись.Контакт = Источник.СторонниеЛица[0].КонтактноеЛицо;
			КонецЕсли;

			Запись.КрайнийСрок = Источник.ОкончаниеМероприятия;
			тТема 			= Источник.Тема;
			ТекстОписания = Строка(Источник.Описание);
			НаКонтроле = Ложь;
			ДатаПолучения = Дата('00010101');
			//Контакт = "";
			КонтактАдрес = "";
			Запись.Пользователь = Источник.Ответственный;
			Срок = Источник.Дата;
			Запись.День = Формат(Срок, "ДЛФ=DD");
			Если ТипЗнч(Источник.ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
				Если Источник.ДокументОснование.CRM_Личная Тогда
					Запись.ВидКартинки = 3;
				Иначе	
					Запись.ВидКартинки = 6;
				КонецЕсли;	
				Если Источник.ДокументОснование.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
					Запись.Избранный = Истина;
				Иначе	
					Запись.Избранный = Ложь;
				КонецЕсли;
			Иначе
				Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
					Запись.Избранный = Источник.ДокументОснование.Избранный;
				КонецЕсли;
				Запись.ВидКартинки = 9;
			КонецЕсли;
			
			Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(Источник.ОкончаниеМероприятия, "ДФ='HH:mm'");
			Если Источник.Ответственный = Источник.Автор Тогда
				Запись.ИзмерениеАРМ = "Текущие";
			Иначе
				Запись.ИзмерениеАРМ = "Входящие";
			КонецЕсли;	
			Если Источник.Состояние = Справочники.CRM_СостоянияСобытий.Завершено Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  Источник.ОкончаниеМероприятия;
			КонецЕсли;	
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
			Запись.ТекстОснования = ТекстОписания;
			
			Запись.Записать(Истина);
			
		КонецЕсли;
		
		//-вог
		//Если ТипЗнч(Ссылка.ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ
		//	|	CRM_ОбъектыАРМ.Объект,
		//	|	CRM_ОбъектыАРМ.НаименованиеАРМ,
		//	|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
		//	|	CRM_ОбъектыАРМ.Пользователь
		//	|ИЗ
		//	|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
		//	|ГДЕ
		//	|	CRM_ОбъектыАРМ.Объект = &Объект
		//	|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
		//	Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
		//	Запрос.УстановитьПараметр("Объект", Ссылка.ДокументОснование);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Пока Выборка.Следующий() Цикл
		//		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		//		Запись.Объект = Ссылка.ДокументОснование;
		//		Запись.НаименованиеАРМ = "МоиДела";
		//		Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
		//		Запись.Пользователь = Выборка.Пользователь;
		//		Запись.Прочитать();
		//		Запись.Удалить();
		//	КонецЦикла;
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ
		//	|	CRM_Взаимодействие.Ссылка
		//	|ИЗ
		//	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		//	|ГДЕ
		//	|	CRM_Взаимодействие.ДокументОснование = &ДокументОснование
		//	|	И CRM_Взаимодействие.СтатусВзаимодействия <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
		//	|	И CRM_Взаимодействие.СтатусВзаимодействия <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)";
		//	Запрос.УстановитьПараметр("ДокументОснование", Ссылка.ДокументОснование);
		//	ВыборкаВзаимодействия = Запрос.Выполнить().Выбрать();
		//	
		//	Если НЕ ВыборкаВзаимодействия.Следующий() Тогда
		//		Если ТипЗнч(Ссылка.ДокументОснование.БизнесПроцесс) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		//			Если ЗначениеЗаполнено(Ссылка.ДокументОснование.БизнесПроцесс.Интерес) И (ТипЗнч(Ссылка.ДокументОснование.БизнесПроцесс.Интерес) = Тип("ДокументСсылка.CRM_Интерес"))
		//				И ЗначениеЗаполнено(Ссылка.ДокументОснование.CRM_СостояниеИнтереса) И Ссылка.ДокументОснование.Исполнитель = Ссылка.ДокументОснование.БизнесПроцесс.Интерес.Ответственный Тогда
		//				Возврат;
		//			КонецЕсли;
		//		КонецЕсли;
		//		
		//		Если ТипЗнч(Ссылка.ДокументОснование.БизнесПроцесс) = Тип("БизнесПроцессСсылка.Задание") Тогда
		//			Проверящющий = Ссылка.ДокументОснование.БизнесПроцесс.Проверяющий;
		//		Иначе
		//			Проверящющий = Неопределено;
		//		КонецЕсли;
		//		
		//		
		//		
		//		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		//		Запись.ДатаДляСортировки = Ссылка.ДокументОснование.СрокИсполнения;
		//		Если Ссылка.ДокументОснование.CRM_Личная И НЕ ЗначениеЗаполнено(Ссылка.ДокументОснование.СрокИсполнения) Тогда
		//			Запись.ДатаДляСортировки = Ссылка.ДокументОснование.Дата;
		//		КонецЕсли;
		//		Запись.Объект = Ссылка.ДокументОснование;
		//		Запись.КрайнийСрок = Ссылка.ДокументОснование.СрокИсполнения;
		//		тТема 			= Ссылка.ДокументОснование.Наименование;
		//		НаКонтроле = (Проверящющий = Ссылка.ДокументОснование.Автор);
		//		ДатаПолучения = Дата('00010101');
		//		Контакт = "";
		//		Если ЗначениеЗаполнено(Ссылка.ДокументОснование.CRM_Партнер) Тогда
		//			Контакт = Ссылка.ДокументОснование.CRM_Партнер.Наименование;
		//			Запись.Клиент = Ссылка.ДокументОснование.CRM_Партнер;
		//			
		//		ИначеЕсли ЗначениеЗаполнено(Ссылка.ДокументОснование.CRM_КонтактноеЛицо) Тогда
		//			Контакт = Ссылка.ДокументОснование.CRM_КонтактноеЛицо.Наименование;
		//			Запись.Контакт = Ссылка.ДокументОснование.CRM_КонтактноеЛицо;
		//		КонецЕсли;
		//		Если ЗначениеЗаполнено(Ссылка.ДокументОснование.CRM_КонтактноеЛицо) Тогда
		//			Запись.Контакт = Ссылка.ДокументОснование.CRM_КонтактноеЛицо;
		//		КонецЕсли;
		//		КонтактАдрес = "";
		//		ТекстОписания = "";
		//		Запись.Пользователь = Ссылка.ДокументОснование.Исполнитель;
		//		Срок = Ссылка.ДокументОснование.СрокИсполнения;
		//		Запись.День = Формат(Срок, "ДЛФ=DD");
		//		Если Ссылка.ДокументОснование.CRM_Личная Тогда
		//			Запись.ВидКартинки = 3;
		//			ТекстОписания = Ссылка.ДокументОснование.Описание;
		//		Иначе	
		//			ТекстОписания = Строка(Ссылка.ДокументОснование.CRM_ТочкаМаршрута);
		//			Запись.ВидКартинки = 6;
		//		КонецЕсли;
		//		Если Ссылка.ДокументОснование.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
		//			Запись.Избранный = Истина;
		//		Иначе	
		//			Запись.Избранный = Ложь;
		//		КонецЕсли;
		//		Запись.Время = Формат(Ссылка.ДокументОснование.СрокИсполнения, "ДФ='HH:mm'") + " - " + Формат(Ссылка.ДокументОснование.СрокИсполнения, "ДФ='HH:mm'");
		//		Если Ссылка.ДокументОснование.Исполнитель = Ссылка.ДокументОснование.Автор Тогда
		//			Запись.ИзмерениеАРМ = "Текущие";
		//		Иначе
		//			Запись.ИзмерениеАРМ = "Входящие";
		//		КонецЕсли;
		//		Если Ссылка.ДокументОснование.Выполнена  Тогда
		//			Запись.ИзмерениеАРМ = "Завершенные";
		//			Запись.ДатаДляСортировки =  Ссылка.ДокументОснование.ДатаИсполнения;
		//		КонецЕсли;
		//		Запись.НаименованиеАРМ = "МоиДела";
		//		
		//		Запись.Заголовок = Строка(тТема);
		//		
		//		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		//		
		//		Запись.ТекстОснования = ТекстОписания;
		//		
		//		Запись.Записать(Истина);	
		//	КонецЕсли;
		//КонецЕсли;	
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Если Ссылка.ПометкаУдаления Тогда
			Возврат;
		КонецЕсли;
		Если ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
			Если ЗначениеЗаполнено(Источник.БизнесПроцесс.Интерес) И (ТипЗнч(Источник.БизнесПроцесс.Интерес) = Тип("ДокументСсылка.CRM_Интерес"))
				И ЗначениеЗаполнено(Источник.CRM_СостояниеИнтереса) И Источник.Исполнитель = Источник.БизнесПроцесс.Интерес.Ответственный Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.Задание") Тогда
			Проверящющий = Источник.БизнесПроцесс.Проверяющий;
		Иначе
			Проверящющий = Неопределено;
		КонецЕсли;
		
		
		Если СтатусЗадачи = Справочники.CRM_СостоянияСобытий.Отменено Тогда
			Возврат;
		КонецЕсли;
		
		// ++ VOG Солодов В.В. 23.10.2020 CRM-992
		Если вогБизнесПроцессыИЗадачиСервер.ЭтоНовоеПоручение(Источник) Тогда
			
			СписокИсполнителей = вогБизнесПроцессыИЗадачиСервер.ПолучитьСписокИсполнителейЗадачиПоручения(Ссылка);
			
			СрокИсполнения 	= Источник.СрокИсполнения;
			Время 			= Формат(СрокИсполнения, "ДФ='HH:mm'");
			
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("ДатаДляСортировки", 	СрокИсполнения);
			СтруктураЗаписи.Вставить("Объект", 				Ссылка);
			СтруктураЗаписи.Вставить("КрайнийСрок", 		СрокИсполнения);
			СтруктураЗаписи.Вставить("День", 				Формат(СрокИсполнения, "ДЛФ=DD"));
			СтруктураЗаписи.Вставить("ВидКартинки", 		6);
			СтруктураЗаписи.Вставить("Избранный", 			(Источник.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая));
			СтруктураЗаписи.Вставить("НаименованиеАРМ", 	"МоиДела");
			СтруктураЗаписи.Вставить("Заголовок", 			Источник.Наименование);
			СтруктураЗаписи.Вставить("ТекстОснования", 		Строка(Источник.CRM_ТочкаМаршрута));
			СтруктураЗаписи.Вставить("Время", 				СтрШаблон(НСтр("ru = '%1 - %1'"), Время));
			
			Для Каждого Исполнитель Из СписокИсполнителей Цикл
				
				Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, СтруктураЗаписи);
				Запись.Пользователь 			= Исполнитель.Значение;
				
				Если Источник.Выполнена Тогда
					Запись.ИзмерениеАРМ 		= "Завершенные";
					Запись.ДатаДляСортировки 	= Источник.ДатаИсполнения;
				ИначеЕсли Источник.ПринятаКИсполнению Или Источник.Исполнитель = Источник.Автор Тогда
					Запись.ИзмерениеАРМ 		= "Текущие";
				Иначе
					Запись.ИзмерениеАРМ 		= "Входящие";
				КонецЕсли;
				
				Запись.Записать(Истина);
				
			КонецЦикла;
			
			CRM_ЗаполнениеАРММоиДелаВзаимодействияЗадачи(Источник);
			
		Иначе // -- VOG Солодов В.В. 23.10.2020 CRM-992
			
			Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			Запись.ДатаДляСортировки = Источник.СрокИсполнения;
			Если Источник.CRM_Личная И НЕ ЗначениеЗаполнено(Источник.СрокИсполнения) Тогда
				Запись.ДатаДляСортировки = Источник.Дата;
			КонецЕсли;
			Запись.Объект = Ссылка;
			Запись.КрайнийСрок = Источник.СрокИсполнения;
			тТема 			= Источник.Наименование;
			НаКонтроле = (Проверящющий = Источник.Автор);
			ДатаПолучения = Дата('00010101');
			Контакт = "";
			Если ЗначениеЗаполнено(Источник.CRM_Партнер) Тогда
				Контакт = Источник.CRM_Партнер.Наименование;
				Запись.Клиент = Источник.CRM_Партнер;
				
			ИначеЕсли ЗначениеЗаполнено(Источник.CRM_КонтактноеЛицо) Тогда
				Контакт = Источник.CRM_КонтактноеЛицо.Наименование;
				Запись.Контакт = Источник.CRM_КонтактноеЛицо;
			КонецЕсли;
			Если ЗначениеЗаполнено(Источник.CRM_КонтактноеЛицо) Тогда
				Запись.Контакт = Источник.CRM_КонтактноеЛицо;
			КонецЕсли;
			КонтактАдрес = "";
			ТекстОписания = "";
			//+вог
			Если Не ЗначениеЗаполнено(Источник.Исполнитель)
				И ЗначениеЗаполнено(Источник.ОсновнойОбъектАдресации)
				И (Источник.РольИсполнителя = Справочники.РолиИсполнителей.вогЗадачиПодразделения 
				ИЛИ Источник.РольИсполнителя = Справочники.РолиИсполнителей.вогЗадачиДолжностнойПозиции) Тогда
				Запись.Пользователь = Источник.ОсновнойОбъектАдресации;
				// ++ VOG Солодов В.В. 01.11.2019 bugs 808
			ИначеЕсли Не ЗначениеЗаполнено(Источник.Исполнитель)
				// +++ VOG Кулаков П.Л. 03.03.2020 CRM-385
				//И Не ЗначениеЗаполнено(Источник.ОсновнойОбъектАдресации)
				// --- VOG Кулаков П.Л.
				И ЗначениеЗаполнено(Источник.РольИсполнителя) Тогда
				
				Запись.Пользователь = Источник.РольИсполнителя;
				// -- VOG Солодов В.В. 01.11.2019
			Иначе	
				Запись.Пользователь = Источник.Исполнитель;
			КонецЕсли;
			//-вог
			Срок = Источник.СрокИсполнения;
			Запись.День = Формат(Срок, "ДЛФ=DD");
			Если Источник.CRM_Личная Тогда
				Запись.ВидКартинки = 3;
				ТекстОписания = Источник.Описание;
			Иначе	
				ТекстОписания = Строка(Источник.CRM_ТочкаМаршрута);
				Запись.ВидКартинки = 6;
			КонецЕсли;
			Если Источник.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
				Запись.Избранный = Истина;
			Иначе	
				Запись.Избранный = Ложь;
			КонецЕсли;
			Запись.Время = Формат(Источник.СрокИсполнения, "ДФ='HH:mm'") + " - " + Формат(Источник.СрокИсполнения, "ДФ='HH:mm'");
			Если Источник.Выполнена  Тогда
				Запись.ИзмерениеАРМ = "Завершенные";
				Запись.ДатаДляСортировки =  Источник.ДатаИсполнения;
			ИначеЕсли Источник.ПринятаКИсполнению ИЛИ Источник.Исполнитель = Источник.Автор Тогда
				Запись.ИзмерениеАРМ = "Текущие";
			Иначе
				Запись.ИзмерениеАРМ = "Входящие";
			КонецЕсли;
			Запись.НаименованиеАРМ = "МоиДела";
			
			Запись.Заголовок = Строка(тТема);
			
			ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
			
			Запись.ТекстОснования = ТекстОписания;
			
			Запись.Записать(Истина);
			
			CRM_ЗаполнениеАРММоиДелаВзаимодействияЗадачи(Источник); // Рефакторинг // ++ VOG Солодов В.В. 23.10.2020 CRM-992
		
		КонецЕсли;
		// -- VOG Солодов В.В. 23.10.2020 CRM-992
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") И Источник.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Входящее Тогда
		Если Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		тТема 			= ?(ЗначениеЗаполнено(Источник.Тема), Источник.Тема, Источник.ТекстСообщения);
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.Контакт;
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			Запись.Клиент = Контакт.Владелец;
			Контакт = Контакт.Владелец;
			
		КонецЕсли;	
		Запись.Контакт = Источник.Контакт;
		КонтактАдрес = Источник.КонтактПредставление;
		ТекстОписания = "";	
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "Входящие";
		Срок = Источник.Дата;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.ВидКартинки = 14;
		Запись.Время = Формат(Источник.Дата, "ДФ='HH:mm'") + " - " + Формат(Источник.Дата, "ДФ='HH:mm'");
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура CRM_ЗаполнениеАРММоиДелаВзаимодействияЗадачи(Знач Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_Взаимодействие.Ссылка
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	CRM_Взаимодействие.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	ВыборкаВзаимодействия = Запрос.Выполнить().Выбрать();
	//ЭтоПервыйПроход = Истина;
	Пока ВыборкаВзаимодействия.Следующий() Цикл
		Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено ИЛИ ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
			Продолжить;
		КонецЕсли;	
		//	Если ЭтоПервыйПроход Тогда
		//		ЭтоПервыйПроход = Ложь;
		//		Запись.Удалить();
		//	КонецЕсли;	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_ОбъектыАРМ.Объект,
		|	CRM_ОбъектыАРМ.НаименованиеАРМ,
		|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
		|	CRM_ОбъектыАРМ.Пользователь
		|ИЗ
		|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
		|ГДЕ
		|	CRM_ОбъектыАРМ.Объект = &Объект
		|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ";
		Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиДела");
		Запрос.УстановитьПараметр("Объект", ВыборкаВзаимодействия.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			Запись.Объект = ВыборкаВзаимодействия.Ссылка;
			Запись.НаименованиеАРМ = "МоиДела";
			Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
			Запись.Пользователь = Выборка.Пользователь;
			Запись.Прочитать();
			Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
		Иначе	
			Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			Если ВыборкаВзаимодействия.Ссылка.Ответственный = ВыборкаВзаимодействия.Ссылка.Автор Тогда
				Запись.ИзмерениеАРМ = "Текущие";
			Иначе
				Запись.ИзмерениеАРМ = "Входящие";
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено Или Источник.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Запись.ДатаДляСортировки = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
		Запись.Объект = ВыборкаВзаимодействия.Ссылка;
		Контакт = "";
		Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.Партнер) Тогда
			Контакт = ВыборкаВзаимодействия.Ссылка.Партнер.Наименование;
			Запись.Клиент = ВыборкаВзаимодействия.Ссылка.Партнер;
		ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
			Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо.Наименование;
			Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
		ИначеЕсли ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент) Тогда
			Контакт = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент.Наименование;
			Запись.Клиент = ВыборкаВзаимодействия.Ссылка.ПотенциальныйКлиент;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо) Тогда
			Запись.Контакт = ВыборкаВзаимодействия.Ссылка.КонтактноеЛицо;
		КонецЕсли;	
		Запись.КрайнийСрок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
		тТема 			= ВыборкаВзаимодействия.Ссылка.Содержание;
		ТекстОписания = Строка(ВыборкаВзаимодействия.Ссылка.СостояниеИнтереса);
		НаКонтроле = Ложь;
		ДатаПолучения = Дата('00010101');
		//Контакт = "";
		КонтактАдрес = "";
		Запись.Пользователь = ВыборкаВзаимодействия.Ссылка.Ответственный;
		Срок = ВыборкаВзаимодействия.Ссылка.ПлановаяДата;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Если Источник.CRM_Личная Тогда
			Запись.ВидКартинки = 3;
			ТекстОписания = Источник.Описание;
		Иначе	
			ТекстОписания = Строка(Источник.CRM_ТочкаМаршрута);
			Запись.ВидКартинки = 6;
		КонецЕсли;
		Если Источник.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;
		
		
		
		Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(ВыборкаВзаимодействия.Ссылка.ПлановаяДатаЗавершение, "ДФ='HH:mm'");
		
		Если ВыборкаВзаимодействия.Ссылка.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено Тогда
			Запись.ИзмерениеАРМ = "Завершенные";
			Запись.ДатаДляСортировки =  ВыборкаВзаимодействия.Ссылка.ДатаЗавершенияВзаимодействия;
		КонецЕсли;
		Запись.НаименованиеАРМ = "МоиДела";
		
		Запись.Заголовок = Строка(тТема);
		
		ТекстОписания = ?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "") + ?(ЗначениеЗаполнено(КонтактАдрес),?(ЗначениеЗаполнено(Контакт)," | ", "")+" <" + КонтактАдрес + ">", "")+?(ЗначениеЗаполнено(Контакт) или ЗначениеЗаполнено(КонтактАдрес)," | ", "")+ТекстОписания;
		
		Запись.ТекстОснования = ТекстОписания;
		
		Запись.Записать(Истина);
		
	КонецЦикла;

КонецПроцедуры

Процедура CRM_ЗаполнениеАРММоиПродажи(Источник, Отказ) Экспорт
	
	Ссылка = Источник.ссылка;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ОбъектыАРМ.Объект,
	|	CRM_ОбъектыАРМ.НаименованиеАРМ,
	|	CRM_ОбъектыАРМ.ИзмерениеАРМ,
	|	CRM_ОбъектыАРМ.Пользователь,
	|	CRM_ОбъектыАРМ.СостояниеИнтереса
	|ИЗ
	|	РегистрСведений.CRM_ОбъектыАРМ КАК CRM_ОбъектыАРМ
	|ГДЕ
	|	CRM_ОбъектыАРМ.Объект = &Объект
	|	И CRM_ОбъектыАРМ.НаименованиеАРМ = &НаименованиеАРМ
	|	И CRM_ОбъектыАРМ.ИзмерениеАРМ <> ""Потерян""
	|	И CRM_ОбъектыАРМ.ИзмерениеАРМ <> ""Закрыт""";
	Запрос.УстановитьПараметр("НаименованиеАРМ", "МоиПродажи");
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.Объект = Ссылка;
		Запись.НаименованиеАРМ = "МоиПродажи";
		Запись.ИзмерениеАРМ = Выборка.ИзмерениеАРМ;
		Запись.СостояниеИнтереса = Выборка.СостояниеИнтереса;
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Прочитать();
		Если Запись.Объект <> Неопределено Тогда
			Запись.Удалить();
			//Если ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Интерес") И (Источник.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересПотерян ИЛИ Источник.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт) Тогда
			//	Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
			//	Запись.ДатаДляСортировки = Источник.ДатаСледующегоДействия;
			//	Запись.Объект = Ссылка;
			//	Запись.НаименованиеАРМ = "МоиПродажи";
			//	Запись.КрайнийСрок = Источник.ДатаСледующегоДействия;
			//	НаКонтроле = Ложь;
			//	ДатаПолучения = Дата('00010101');
			//	//Запись.ВоронкаПродаж = Выборка.ВоронкаПродаж;
			//	Запись.ИзмерениеАРМ = ?(Источник.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересПотерян, "Потерян", "Закрыт");
			//	Запись.Пользователь = Источник.Ответственный;
			//	Срок = Источник.ДатаСледующегоДействия;
			//	Запись.День = Формат(Срок, "ДЛФ=DD");
			//	Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(Источник.ДатаСледующегоДействия, "ДФ='HH:mm'");
			//	Запись.ТекстОснования = Источник.Тема;
			//	Запись.Заголовок = Источник.Тема;
			//	Запись.Записать(Истина);
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Если Ссылка.ПометкаУдаления ИЛИ НЕ РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка) Тогда
			Возврат;
		КонецЕсли;
		Если НЕ РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(Ссылка) И Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.ОтправительКонтакт;
		КонтактАдрес = Источник.ОтправительАдрес;
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "НеРазобрано";
		Запись.НаименованиеАРМ = "МоиПродажи";
		Срок = Источник.ДатаПолучения;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.Время = Формат(Источник.ДатаПолучения, "ДФ='HH:mm'") + " - " + Формат(Источник.ДатаПолучения, "ДФ='HH:mm'");
		тКрайнийСрок 	= Формат(Запись.КрайнийСрок, "ДФ='d MMM'");
		Текст			= тКрайнийСрок + " | " + Строка(?(ЗначениеЗаполнено(Контакт), Строка(Контакт) + " <" + КонтактАдрес + ">", КонтактАдрес));
		Запись.ТекстОснования = Текст;
		Запись.ВидКартинки = 12;
		Если Источник.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;
		Запись.Заголовок = Источник.Тема;
		Запись.Записать(Истина);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Заявка") Тогда
		ЭтоТекущийЛид = РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(Ссылка);
		Если НЕ ЭтоТекущийЛид И Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.Наименование;
		КонтактАдрес = Источник.ЭлектроннаяПочта;
		КонтактТелефон = Источник.Телефон;
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "НеРазобрано";
		Запись.НаименованиеАРМ = "МоиПродажи";
		Срок = Источник.Дата;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.Время = Формат(Источник.Дата, "ДФ='HH:mm'") + " - " + Формат(Источник.Дата, "ДФ='HH:mm'");
		тКрайнийСрок 	= Формат(Запись.КрайнийСрок, "ДФ='d MMM'");
		Текст			= тКрайнийСрок + " | " + Строка(?(ЗначениеЗаполнено(Контакт), Строка(Контакт), "")) + ?(ЗначениеЗаполнено(КонтактТелефон), " <" + КонтактТелефон + ">", "") + ?(ЗначениеЗаполнено(КонтактАдрес), " <" + КонтактАдрес + ">", "");
		Запись.ТекстОснования = Текст;
		Запись.ВидКартинки = 12;
		Запись.Избранный = Ложь;
		Запись.Заголовок = Источник.Тема;
		Запись.Записать(Истина);	
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Если Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Если НЕ Источник.Входящий Тогда Возврат КонецЕсли;
		Если Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.АбонентКонтакт;
		КонтактАдрес = Источник.АбонентКакСвязаться;
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "НеРазобрано";
		Запись.НаименованиеАРМ = "МоиПродажи";
		Срок = Источник.Дата;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Запись.Время = Формат(Срок, "ДФ='HH:mm'") + " - " + Формат(Срок, "ДФ='HH:mm'");
		тКрайнийСрок 	= Формат(Запись.КрайнийСрок, "ДФ='d MMM'");
		Текст			= тКрайнийСрок + " | " + Строка(?(ЗначениеЗаполнено(Контакт), Строка(Контакт) + " <" + КонтактАдрес + ">", КонтактАдрес));
		Запись.ТекстОснования = Текст;
		Запись.Заголовок = Источник.Тема;
		Запись.ВидКартинки = 13;
		Если Источник.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая Тогда
			Запись.Избранный = Истина;
		Иначе	
			Запись.Избранный = Ложь;
		КонецЕсли;
		Запись.Записать(Истина);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		Если Источник.ПометкаУдаления Тогда
			Возврат;
		КонецЕсли;
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		Если ЗначениеЗаполнено(ВалютаУправленческогоУчета) Тогда
			Если ВалютаУправленческогоУчета.Код = "643" Тогда
				// Рубль
				ВалютаПредставление = Символ("8381");
			ИначеЕсли ВалютаУправленческогоУчета.Код = "978" Тогда
				// Евро
				ВалютаПредставление = Символ("8364");
			ИначеЕсли ВалютаУправленческогоУчета.Код = "840" Тогда
				// Доллар
				ВалютаПредставление = Символ("36");
			Иначе
				ВалютаПредставление = ВалютаУправленческогоУчета.Наименование;
			КонецЕсли;
		Иначе
			ВалютаПредставление = "";
		КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = ?((Источник.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересПотерян ИЛИ Источник.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт), Источник.ДатаЗакрытия, Источник.ДатаСледующегоДействия);
		Запись.Объект = Ссылка;
		Запись.НаименованиеАРМ = "МоиПродажи";
		Запись.КрайнийСрок = Источник.ДатаСледующегоДействия;
		НаКонтроле = Ложь;
		ДатаПолучения = Дата('00010101');
		Запись.СостояниеИнтереса = Источник.СостояниеИнтереса;
		//Запись.ИзмерениеАРМ = ?(Источник.СостояниеИнтереса <> Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт, ВыборкаВоронка.Этап.Наименование, "Закрыт");;
		Запись.Пользователь = Источник.Ответственный;
		Срок = Источник.ДатаСледующегоДействия;
		Запись.День = Формат(Срок, "ДЛФ=DD");
		Запись.Время = Формат(Срок, "ДФ=HH:mm") + " - " + Формат(Источник.ДатаСледующегоДействия, "ДФ='HH:mm'");
		Запись.ТекстОснования = Источник.Тема;
		Запись.Заголовок = Источник.Тема;
		Запись.ВидКартинки = 9;
		Запись.Избранный = Источник.Избранный;
		КоличествоТегов = Источник.CRM_Теги.Количество();
		Запись.ОписаниеИнтереса	= ?(ЗначениеЗаполнено(Источник.ДатаСледующегоДействия), Формат(Источник.ДатаСледующегоДействия, "ДФ=dd.MM.yyyy"), "");
		Запись.ОписаниеИнтереса = Запись.ОписаниеИнтереса + ?(ЗначениеЗаполнено(Источник.ОжидаемаяВыручка), ", ", "") + ?(ЗначениеЗаполнено(Источник.ОжидаемаяВыручка), Строка(Источник.ОжидаемаяВыручка) + " " + ВалютаПредставление, "") + ?(КоличествоТегов > 0, ", ", "");
		Для Каждого тТег Из Источник.CRM_Теги Цикл
			Запись.ОписаниеИнтереса 	= Запись.ОписаниеИнтереса + Строка(тТег.Тег) + " | ";
		КонецЦикла;
		Если КоличествоТегов > 0 Тогда
			Запись.ОписаниеИнтереса	= Лев(Запись.ОписаниеИнтереса, СтрДлина(Запись.ОписаниеИнтереса)-3);
		КонецЕсли;
		
		Запись.Записать(Истина);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") И Источник.ВидСообщения = Перечисления.CRM_ВидыСообщенияМессенджера.Входящее Тогда
		Если НЕ РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Ссылка) Тогда
			Возврат;
		КонецЕсли;
		Если НЕ РегистрыСведений.CRM_СостоянияЛидов.ЭтоТекущийЛид(Ссылка) И Ссылка.CRM_СкрытьВАРМ Тогда Возврат КонецЕсли;
		Запись = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьМенеджерЗаписи();
		Запись.ДатаДляСортировки = Источник.Дата;
		Запись.Объект = Ссылка;
		Запись.КрайнийСрок = Источник.Дата;
		НаКонтроле = Ложь;
		ДатаПолучения = Источник.Дата;
		Контакт = Источник.Контакт;
		КонтактАдрес = Источник.КонтактПредставление;
		Запись.Пользователь = Источник.Ответственный;
		Запись.ИзмерениеАРМ = "НеРазобрано";
		Запись.НаименованиеАРМ = "МоиПродажи";
		Срок = Источник.Дата;
		Запись.День =  Формат(Срок, "ДЛФ=DD");
		Запись.Время = Формат(Источник.Дата, "ДФ='HH:mm'") + " - " + Формат(Источник.Дата, "ДФ='HH:mm'");
		тКрайнийСрок 	= Формат(Запись.КрайнийСрок, "ДФ='d MMM'");
		Текст			= тКрайнийСрок + " | " + Строка(?(ЗначениеЗаполнено(Контакт), Строка(Контакт) + " <" + КонтактАдрес + ">", КонтактАдрес));
		Запись.ТекстОснования = Текст;
		Запись.ВидКартинки = 14;
		Запись.Заголовок = ?(ЗначениеЗаполнено(Источник.Тема), Источник.Тема, Источник.ТекстСообщения);
		Запись.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура CRM_ЗаполнениеАРМПриЗаписи(Источник, Отказ) Экспорт
	Если ТипЗнч(Источник) <> Тип("ДокументОбъект.CRM_Заявка") Тогда
		CRM_ЗаполнениеАРММоиДела(Источник, Отказ);
	КонецЕсли;	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Интерес") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронноеПисьмоВходящее") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ТелефонныйЗвонок") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_СообщениеМессенджера") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.CRM_Заявка") Тогда
		CRM_ЗаполнениеАРММоиПродажи(Источник, Отказ);
	конецЕсли;
КонецПроцедуры

Процедура ПервоначальноеЗаполнениеАРМ(Параметры) Экспорт
	Набор = РегистрыСведений.CRM_ОбъектыАРМ.СоздатьНаборЗаписей();
	Набор.Записывать = Истина;
	Набор.Записать(Истина);
	
	//Мои дела
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТелефонныйЗвонок.Ссылка,
	|	ЛОЖЬ КАК НаКонтроле,
	|	ТелефонныйЗвонок.Тема КАК Тема,
	|	ТелефонныйЗвонок.Дата КАК ДатаПолучения,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК КрайнийСрок,
	|	ТелефонныйЗвонок.АбонентКонтакт КАК Контакт,
	|	ТелефонныйЗвонок.АбонентКакСвязаться КАК КонтактАдрес
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭлектронноеПисьмоВходящее.Ссылка,
	|	ЛОЖЬ,
	|	ЭлектронноеПисьмоВходящее.Тема,
	|	ЭлектронноеПисьмоВходящее.ДатаПолучения,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	|	ЭлектронноеПисьмоВходящее.ОтправительКонтакт,
	|	ЭлектронноеПисьмоВходящее.ОтправительАдрес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ссылка.Пустая() Тогда Продолжить конецЕсли;
		Об = Выборка.ссылка.получитьОбъект();
		CRM_ЗаполнениеАРММоиДела(Об, Ложь);
		CRM_ЗаполнениеАРММоиПродажи(Об, Ложь)
	КонецЦикла;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	CRM_АРМ_ПорядокОбъектов.Пользователь,
	//|	CRM_АРМ_ПорядокОбъектов.ИзмерениеАРМ,
	//|	CRM_АРМ_ПорядокОбъектов.Объект
	//|ИЗ
	//|	РегистрСведений.CRM_АРМ_ПорядокОбъектов КАК CRM_АРМ_ПорядокОбъектов
	//|ГДЕ
	//|	CRM_АРМ_ПорядокОбъектов.НаименованиеАРМ = ""Мои дела""";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Измерение = Выборка.ИзмерениеАРМ;
	//	Попытка
	//		CRM_ЗаполнениеАРМПриЗаписи(Выборка.Объект, Ложь);
	//	Исключение
	//	КонецПопытки;	
	//КонецЦикла;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_Взаимодействие.Ссылка
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	|ГДЕ
	|	НЕ CRM_Взаимодействие.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачаИсполнителя.Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		CRM_ЗаполнениеАРМПриЗаписи(Выборка.Ссылка, Ложь);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_ЗадачиПользователей.Объект КАК Ссылка,
	|	ВЫБОР
	|		КОГДА CRM_ЗадачиПользователей.Объект.Ссылка ССЫЛКА Задача.ЗадачаИсполнителя
	|			ТОГДА ВЫБОР
	|					КОГДА CRM_ЗадачиПользователей.Объект.Выполнена
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|					ИНАЧЕ CRM_ЗадачиПользователей.Статус
	|				КОНЕЦ
	|		ИНАЧЕ CRM_ЗадачиПользователей.Статус
	|	КОНЕЦ КАК Статус,
	|	CRM_ЗадачиПользователей.Пользователь
	|ИЗ
	|	РегистрСведений.CRM_ЗадачиПользователей КАК CRM_ЗадачиПользователей
	|ГДЕ
	|	CRM_ЗадачиПользователей.Статус <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Статус = Справочники.CRM_СостоянияСобытий.Завершено Тогда
			Попытка
				CRM_ЗаполнениеАРМПриЗаписи(Выборка.Ссылка, Ложь);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;
	
	//Мои продажи
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_Интерес.Ссылка
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|ГДЕ
	|	НЕ CRM_Интерес.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ссылка.Пустая() Тогда Продолжить конецЕсли;
		Об = Выборка.ссылка.получитьОбъект();
		CRM_ЗаполнениеАРММоиПродажи(Об, Ложь)
	КонецЦикла;
КонецПроцедуры
